# DockablePaneProviderData Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePaneProviderData Constructor
DockablePaneProviderData Class See Also
---
Initializes a new instance of the DockablePaneProviderData class
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DockablePaneProviderData()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DockablePaneProviderData()
```

# See Also
DockablePaneProviderData Class
Autodesk.Revit.UI Namespace